Repository: HyperIoT-Labs/HyperIoT-UI
Catalog: src/locale/translations.*.xlf
Languages: it

# HYT_service_temporarily_unavailable
source: Service temporarily unavailable
it: Servizio temporaneamente non disponibile

# HYT_server_error_500
source: Internal error
it: Errore interno al server

# HYT_unknown_error
source: Error executing your request
it: Errore nell'esecuzione della richiesta

# HYT_duplicate_entity
source: Already in use
it: già in uso

# HYT_wrong_user_or_password
source: Wrong username or password
it: Username o password errati

# HYT_error_403
source: Your account is not activated. Please activate your account with the activation link we send you by email
it: Il tuo account non è attivo. Per favore, attiva il tuo account con la mail che ti abbiamo inviato.

# HYT_field_required
source: The field is required
it: Il campo è obbligatorio

# HYT_valid_email
source: Please enter a valid email address
it: Inserire un indirizzo email valido

# HYT_min_length
source: At least 8 character length
it: Almeno 8 caratteri

# HYT_min_one_number
source: At least one enumber
it: Alemno un numero

# HYT_upper_case
source: At least one uppercase character
it: Almeno un carattere maiuscolo

# HYT_special_char
source: At least one special character
it: Almeno un carattere speciale

# HYT_password_reset_1
source: Need to reset your password?
it: Hai bisogno di resettare la tua password?

# HYT_password_reset_2
source: No problem! Fill in the fields below and we will send you a confirmation email
it: Nessun problema! Riempi i campi qui sotto e ti manderemo una mail di conferma

# HYT_passwordConfirm
source: Confirm password
it: Conferma password

# HYT_reset_password
source: Reset Password
it: Resetta password

# HYT_back_to_home
source: Back to Home
it: Torna ad Home

# HYT_password_reset_3
source: Check in your Email!
it: Controlla le tue email!

# HYT_password_reset_4
source: We just emailed you with the new password
it: Ti abbiamo inviato una mail per resettare la tua passwotd

# HYT_back_to_login
source: Back to login
it: Torna al Login

# HYT_something_went_wrong
source: Something went wrong
it: Qualcosa è andato storto

# HYT_acivation_incorrect_data
source: The data used is incorrect, check and try again.
it: I dati sono errati, riprova.

# HYT_return_to_home
source: Return to Home
it: Ritorna ad Home

# HYT_activation_success_1
source: Congratulations, Your account is now active!!
it: Congratulazioni, il tuo account è attivo

# HYT_activation_success_2
source: Start now to find out what you can do and have fun.
it: Comincia ora a scoprire cosa puoi fare e divertiti

# HYT_go_to_home
source: Go to Home
it: Vai a Home

# HYT_hello
source: Hello
it: Ciao

# HYT_login_text
source: We are happy to see you again!
it: Siamo felici di vederti di nuovo!

# HYT_login_no_account
source: Don't have an account?
it: Non hai un account?

# HYT_register_now
source: Register Now
it: Registrati ora

# HYT_login_register_message
source: and Enjoy all our benefits!
it: e goditi tutti i nostri benefici

# HYT_login_to_account
source: Login to your Account
it: Login

# HYT_username_or_email
source: Username or email
it: Username o email

# HYT_login_forgot_password
source: Forgot password?
it: Password dimenticata?

# HYT_remember_me
source: Remember me
it: Ricordati di me

# HYT_welcome
source: Welcome
it: Benvenuto

# HYT_registration_1
source: register and enjoy our benefits
it: Registrati e goditi i nosttri benefici

# HYT_already_member_question
source: Already a Member?
it: Sei già registrato?

# HYT_login_now
source: Login now
it: Fai il login

# HYT_registration_login_message
source: and enjoy the experience
it: e goditi l'esperienza

# HYT_registration
source: Registration
it: Registrazione

# HYT_name
source: Name
it: Nome

# HYT_surname
source: Surname
it: Cognome

# HYT_username
source: Username or email
it: Username

# HYT_password_confirm
source: Confirm password
it: Conferma password

# HYT_terms_of_use
source: Terms of use
it: Termini di utilizzo

# HYT_and
source: and
it: e

# HYT_registration_button
source: Sign In
it: Registrati

# HYT_registration_form_ok
source: Please click on the link that has just been sent to your email account to complete the registration process
it: Controlla la tua casella email. Ti abbiamo inviato una mail per completare la registrazione

# HYT_password_recovery_1
source: Did you forget your password?
it: Hai scordato la password?

# HYT_password_recovery_2
source: Can't log in? We will send you instructions to reset your password.
it: Non riesci a fare login? Ti manderemo le istruzioni per resettare la tua password.

# HYT_email_me
source: Email me
it: Manda email

# HYT_password_recovery_3
source: Check in your Email!
it: Controlla le tue email

# HYT_password_recovery_4
source: We just emailed you with the instructions to reset your password
it: Ti abbiamo inviato le istruzioni per resettare la tua password

# HYT_cancel
source: Cancel
it: Annulla

# HYT_delete
source: Delete
it: Elimina

# HYT_application_short_definition
source: Application short definition...
it: Applicazione definizione breve...

# HYT_application_definition
source: Application definition...
it: Applicazione definizione...

# HYT_application_long_definition
source: Application long definition...
it: Applicazione definizione lunga...

# HYT_project_displaylistname
source: Project
it: Progetto

# HYT_project_form_title
source: Project
it: Progetto

# HYT_project_short_definition
source: Project short definition...
it: Progetto definizione breve...

# HYT_project_definition
source: Project definition...
it: Progetto definizione...

# HYT_project_long_definition
source: Project long definition...
it: Progetto lunga definizione...

# HYT_device_short_definition
source: Device short definition...
it: Dispositivo definizione corta...

# HYT_device_definition
source: Device definition...
it: Dispositivo definizione...

# HYT_device_long_definition
source: Device long definition...
it: Dispositivo definizione lunga...

# HYT_packet_displaylistname
source: Packets
it: Pacchetti

# HYT_packet_form_title
source: Packets
it: Pacchetto

# HYT_packet_short_definition
source: Packet short definition...
it: Pacchetto definizione breve...

# HYT_packet_definition
source: Packet definition...
it: Pacchetto definizione...

# HYT_packet_long_definition
source: Packet long definition...
it: Pacchetto lunga definizione...

# HYT_field_displaylistname
source: Fields
it: Campi

# HYT_field_form_title
source: Packet fields
it: Campi Pacchetto

# HYT_fields_short_definition
source: Fields short definition...
it: Campo defizione breve...

# HYT_fields_definition
source: Fields definition...
it: Campo defizione...

# HYT_fields_long_definition
source: Fields long definition...
it: Campo definizione lunga...

# HYT_enrichment_displaylistname
source: Enrichment
it: Arricchimente

# HYT_enrichment_form_title
source: Packet Enrichments
it: Arricchimento Pacchetto

# HYT_enrichment_short_definition
source: Enrichment short definition...
it: Arricchimento defizione breve...

# HYT_enrichment_definition
source: Enrichment definition...
it: Arricchimento defizione...

# HYT_enrichment_long_definition
source: Enrichment long definition...
it: Arricchimente definizione lunga...

# HYT_statistic_displaylistname
source: Statistics
it: Statistiche

# HYT_statistic_form_title
source: Project Statistics
it: Statistiche Progetto

# HYT_statistics_short_definition
source: Statistics short definition...
it: Statistiche definizione breve...

# HYT_statistics_definition
source: Statistics definition...
it: Statistiche definizione...

# HYT_statistics_long_definition
source: Statistics long definition...
it: Statistiche lunga definizione...

# HYT_event_displaylistname
source: Events
it: Eventi

# HYT_event_form_title
source: Packet Events
it: Eventi Pacchetto

# HYT_events_short_definition
source: Events short definition
it: Eventi definizione breve...

# HYT_events_definition
source: Events definition
it: Eventi definizione ...

# HYT_events_long_definition
source: Events long definition
it: Eventi definizione lunga...

# HYT_alarm_displaylistname
source: Alarms
it: Allarmi

# HYT_alarm_form_title
source: Alarms
it: Allarmi

# HYT_alarms_short_definition
source: Alarms short definition
it: Allarmi definizione breve...

# HYT_alarms_definition
source: Alarms definition
it: Allarmi definizione

# HYT_alarms_long_definition
source: Alarms long definition
it: Allarmi definizione lunga...

# HYT_alarm_delete_last_event_title
source: Confirmation of cancellation last event
it: Conferma della cancellazione dell'ultimo evento

# HYT_alarm_delete_last_event
source: Do you want to cancel the last event as well? If you confirm the alarm will also be cancelled.
it: Vuoi cancellare l'ultimo evento? Se convermi anche l'allarme verrà eliminato.

# HYT_delete_item_question
source: Do you really want to delete this item?
it: Sei sicuro di voler eliminare l'oggetto?

# HYT_packet_delete_packet_question
source: Do you really want to delete this packet?
it: Sei sicuro di voler eliminare il pacchetto?

# HYT_operation_can_not_be_undone
source: This operation can not be undone
it: Questa operazione è definitiva

# HYT_hint_device_name
source: Enter the device name.
it: Inserire il nome del dispositivo.

# HYT_hint_device_password
source: Enter the device password.
it: Inserire la password del dispositivo.

# HYT_hint_password_confirm
source: Confirm device password.
it: Confermare la password del dispositivo.

# HYT_description
source: Description
it: Descrizione

source: HYT_hint_device_description
it: Inserire la descrizione del dispositivo.

# HYT_loading_data
source: Loading data...
it: Caricamento dati...

# HYT_error_occurred
source: An unexpected error has occurred
it: Si è verificato un errore inaspettato

# HYT_close
source: Close
it: Chiudi

# HYT_saving_data
source: Saving data...
it: Salvataggio dati...

# HYT_unavailable_application_name
source: Unavailable application name
it: Nome applicazione non disponibile

# HYT_application_name_in_use
source: Application name already in use
it: Nome applicazione già in uso

# HYT_brand
source: Brand
it: Marca

# HYT_hint_device_brand
source: Enter the device brand.
it: Inserire la marca del dispositivo.

# HYT_model
source: Model
it: Modello

# HYT_hint_device_model
source: Enter the device model.
it: Inserire il modello del dispositivo.

# HYT_software_version
source: Software version
it: Versione software

# HYT_hint_device_software
source: Enter the device software version.
it: Inserire la versione del software del dispositivo.

# HYT_firmware_version
source: Firmware version
it: Versione firmware

# HYT_hint_device_firmware
source: Enter the device firmware version.
it: Inserire la versione del firmware del dispositivo.

# HYT_unavailable_device_name
source: Unavailable device name
it: Nome device non disponibile

# HYT_device_name_already_in_use
source: Device name already in use
it: Nome device già in uso

# HYT_error
source: Error
it: Errore

# HYT_error_loading_rule
source: An error occurred while loading the rule. This may have happened for one or more of the following reasons:
it: Errore nel caricamento della regola. Questo può essere legato ad una o più delle seguenti ragioni:

# HYT_field_name_modified
source: The name of one rule's field has been modified
it: Il nome di un campo della regola è stato modificato

# HYT_field_deleted
source: A rule's field has been deleted
it: Un campo della regola è stato eliminato

# HYT_packet_deleted
source: A rule's packet has been deleted (only events)
it: Un pacchetto della regola è stato eliminato (solo eventi)

# HYT_obsolete_syntax_rule
source: Rule's syntax was updated making the rule now obsolete
it: La sintassi delle regole è stata modificata e quindi ora la regola è obsoleta

# HYT_error_loading_rule_2
source: Please, redefine a new rule and delete the old one.
it: Per favore, ricrea la regola ed elimina la vecchia

# HYT_packet
source: Packet
it: Pacchetto

# HYT_field
source: Field
it: Campo

# HYT_condition
source: Condition
it: Condizione

# HYT_value
source: Value
it: Valore

# HYT_(&gt;)_greater
source: (>) Greater
it: (>) Maggiore

# HYT_(&gt;=)_greater_equal
source: (>=) Greater/Equal
it: (>=) Maggiore/Uguale

# HYT_(&lt;)_lower
source: (<) Lower
it: (<) Minore

# HYT_(&lt;=)_lower_equal
source: (<=) Lower/Equal
it: (<=) Minore/Uguale

# HYT_(==)_equal
source: (=) Equal
it: (=) Uguale

# HYT_(!=)_different
source: (!=) Different
it: (!=) Diverso

# HYT_is_true
source: Is true
it: è vero

# HYT_is_false
source: Is false
it: è falso

# HYT_title_categories
source: Categories
it: Categorie

# HYT_hint_rule_name
source: Enter the rule name
it: Inserire il nome della regola.

# HYT_rule_type
source: Rule type
it: Tipo regola

# HYT_hint_rule_description
source: Enter the rule description.
it: Inserire la descrizione della regola.

# HYT_categories
source: Categories
it: Categorie

# HYT_tags
source: Tags
it: Tag

# HYT_validation
source: Validation
it: Validazione

# HYT_fourier_transform
source: FourierTransform
it: Trasformata di Fourier

# HYT_unavailable_rule_name
source: Unavailable rule name
it: Nome regola non disponibile

# HYT_definition_of_terms
source: Definition of terms
it: Definizione dei termini

# HYT_mail_to
source: Recipient
it: Destinatari

# HYT_mail_cc
source: CC
it: Copia

# HYT_mail_object
source: Object
it: Oggetto

# HYT_mail_body
source: Mail body
it: Corpo della mail

# HYT_name_of_rule
source: The name of the rule
it: Nome della regola

# HYT_description_of_rule
source: The description of the rule
it: Descrizione della regola

# HYT_name_of_field
source: The name of the field
it: Nome del campo

# HYT_name_of_event_mail
source: The name of the event mail
it: Nome dell'evento mail

# HYT_hint_event_name
source: Enter the event name
it: Inserire il nome dell'evento.

# HYT_hint_event_description
source: Enter the event description
it: Inserire la descrizione dell'evento.

# HYT_output_data
source: Event output
it: Output evento

# HYT_add_event
source: Add event
it: Aggiungi evento

# HYT_send_email
source: SEND E-MAIL
it: MANDA E-MAIL

# HYT_unavailable_event_name
source: Unavailable event name
it: Nome evento non disponibile

# HYT_hint_field_name
source: Enter the field name.
it: Inserire il nome del campo.

# HYT_type
source: Type
it: Tipo

# HYT_hint_field_type
source: Select field type.
it: Selezionare il tipo di campo.

# HYT_hint_field_description
source: Enter the field description.
it: Inserire la descrizione del campo.

# HYT_multiplicity
source: Multiplicity
it: Molteplicità

# HYT_hint_select_measure_type
source: Select measurement type.
it: Selezionare il tipo di misurazione.

# HYT_hint_select_measure_unit
source: Select measure unit.
it: Selezionare unità di misura.

# HYT_not_specified
source: (not specified)
it: (non specificato)

# HYT_delete_item
source: Delete item?
it: Eliminare oggetto?

# HYT_field_delete_item
source: Delete the field?
it: Eliminare il campo?

# HYT_operation_cannot_be_undone
source: This operation cannot be undone.
it: Questa operazione non può essere annullata.

# HYT_field_operation_cannot_be_undone
source: If you delete the field, any configurations inside the widgets will be reset and will have to be set again.
it: Se elimini il campo eventuali configurazioni all'interno dei widget verranno resettate ed andranno impostate nuovamente.

# HYT_packet_operation_cannot_be_undone
source: If you delete the packet, any configurations inside the widgets will be reset and will have to be set again.
it: Se elimini il pacchetto eventuali configurazioni all'interno dei widget verranno resettate ed andranno impostate nuovamente.

# HYT_hint_packet_name
source: Enter the packet name.
it: Inserire nome pacchetto.

# HYT_traffic_plan
source: Traffic plan
it: Piano traffico dati

# HYT_hint_packet_traffic_plan
source: Select traffic plan.
it: Selezionare piano traffico.

# HYT_hint_packet_type
source: Set the packet type.
it: Selezionare il tipo di pacchetto.

# HYT_format
source: Format
it: Formato

# HYT_serialization
source: Serialization
it: Serializzazione

# HYT_timestamp_field
source: Timestamp field
it: Campo Timestamp

# HYT_hint_packet_timestamp_field
source: Enter the timestamp field name.
it: Inserire nome del campo timestamp.

# HYT_timestamp_format
source: Timestamp format
it: Formato Timestamp

# HYT_hint_packet_enter_timestamp_format
source: Enter the timestamp field format: eg. 'dd/MM/yyyy HH.mmZ'.
it: Inserire il formato del campo timestamp: e.g. 'dd/MM/yyyy HH.mmZ'.

# HYT_mqtt_url
source: MQTT Url
it: Url MQTT

# HYT_unavailable_packet_name
source: Unavailable packet name
it: Nome pacchetto non disponibile

# HYT_hint_project_name
source: Enter the project name.
it: Inserire nome progetto.

# HYT_hint_project_description
source: Enter the project description.
it: Inserire descrizione progetto.

# HYT_unavailable_project_name
source: Unavailable project name
it: Nome progetto non disponibile

# HYT_unsaved_data
source: Unsaved data
it: Dati non salvati

# HYT_unsaved_changes_lost
source: If you leave the page the unsaved changes will be lost
it: Se lasci la pagina le modifiche non salvate saranno perse

# HYT_remain
source: Remain
it: Rimani

# HYT_discard_changes
source: Discard Changes
it: Scarta modifiche

# HYT_choose_how_proceed
source: Choose how to proceed
it: Scegli come procedere

# HYT_enrichment_data
source: Enrichment data
it: Arricchimento dati

# HYT_enrichment_definition_long
source: Create custom rules and connect them together to enrich the data.
it: Crea delle regole personalizzate e collegale tra di loro per arricchire i dati.

# HYT_statistics
source: Statistics
it: Statistiche

# HYT_statistics_definition_long
source: Select an algorithm and set the data monitoring frequency.
it: Seleziona un algoritmo e stabilisci la frequenza di monitoraggio dei dati.

# HYT_events
source: Events
it: Eventi

# HYT_events_definition_long
source: Establish the conditions of the events to be monitored and the actions to be performed when they occur.
it: Stabilisci le condizioni degli eventi da monitorare e le azioni da eseguire al loro verificarsi.

# HYT_finish
source: Finish
it: Finisci

# HYT_congratulations
source: Congratulations
it: Congratulazioni

# HYT_pw_finsh
source: You have finished to configure your project
it: Hai finito di configurare il tuo progetto

# HYT_go_to_project_list
source: Go to project list
it: Vai alla lista progetti

# HYT_wizard_report_modal_go_to_project_list_long
source: You will find the list of all your projects in card format.
it: Troverai la lista di tutti i tuoi progetti in formato card.

# HYT_go_to_dashboard
source: Go to dashboard
it: Vai alla dashboard

# HYT_go_to_dashboard_long
source: You will be able to configure widgets to monitor the data within your projects.
it: Potrai configurare i widget per monitorare i dati all'interno dei tuoi progetti.

# HYT_device
source: Devices
it: Dispositivo

# HYT_algorithm
source: Algorithm
it: Algoritmo

# HYT_go_to_algorithms_list_long
source: Go to algorithms list definition.
it: Vai alla lista degli algoritmi.

# HYT_fields
source: Fields
it: Campi

# HYT_time_range
source: Time range
it: Range tempo

# HYT_source_data
source: Source Data
it: Fonte dati

# HYT_average
source: Average
it: Media

# HYT_media_2_fields
source: Media 2 fields
it: Media a 2 campi

# HYT_media_3_fields
source: Media 3 fields
it: Media a 3 campi

# HYT_predictive
source: Predictive
it: Predittivo

# HYT_regression
source: Regression
it: Regressione

# HYT_string
source: String
it: Stringa

# HYT_variance
source: Variance
it: Varianza

# HYT_daily
source: Daily
it: Ogni ora

# HYT_weekly
source: Weekly
it: Settimanale

# HYT_monthly
source: Monthly
it: Mensile

# HYT_quarterly
source: Quarterly
it: Trimestrale

# HYT_four_monthly
source: Four monthly
it: Quadrimestrale

# HYT_half_yearly
source: Half yearly
it: Semestrale

# HYT_annual
source: Annual
it: Annuale

# HYT_temperature
source: Temperature
it: Temperatura

# HYT_humidity
source: Humidity
it: Umidità

# HYT_projects_wizard
source: Projects Wizard
it: Wizard Progetto

# HYT_next
source: Next
it: Avanti

# HYT_select_source_type
source: Select Source Type
it: Seleziona tipo fonte

# HYT_save
source: Save
it: Salva

# HYT_update
source: Update
it: Aggiorna

# HYT_save_event
source: Save Event
it: Salva Evento

# HYT_update_event
source: Update Event
it: Aggiorna Evento

# HYT_another_event
source: Add another Event
it: Aggiunti un altro Evento

# HYT_alarm_save_changes
source: Do you want to save the alarm and lost the pending changes?
it: Vuoi davvvero salvare l'allarme e perdere le modifiche in sospeso?

# HYT_back_to_event
source: Back to Alarm
it: Torna all'allarme

# HYT_event_saved
source: Event saved!
it: Evento salvato!

# HYT_remember_changes
source: Remember to save the alarm to maintain the changes
it: Ricorda di salvare l'allarme per mantenere le modifiche

# HYT_event_new
source: New event!
it: Nuovo evento!

# HYT_event_new_desc
source: New event saved correctly
it: Nuovo evento salvato correttamente

# HYT_event_remember
source: Remember!
it: Ricorda!

# HYT_event_still_changes
source: You still have to save the alarm changes
it: Devi ancora salvare le modifiche dell'allarme

# HYT_event_updated
source: Event updated!
it: Evento aggiornato!

# HYT_event_updated_desc
source: Event updated correctly
it: Evento aggiornato correttamente

# HYT_alarm_and_events
source: Alarm and events added!
it: Allarme ed Eventi aggiunti!

# HYT_alarm_and_events_desc
source: Alarm and events added correctly
it: Allarme ed Eventi aggiunti correttamente

# HYT_alarm_updated
source: Alarm updated!
it: Allarme aggiornato!

# HYT_alarm_updated_desc
source: Alarm updated correctly
it: Allarme aggiornato correttamente

# HYT_event_deleted
source: Event deleted!
it: Evento eliminato!

# HYT_event_deleted_desc
source: Event deleted correctly
it: Evento eliminato correttamente

# HYT_event_will_be_lost
source: The current event will be lost
it: L'evento attuale andrà perso

# HYT_back
source: Back
it: Indietro

# HYT_application
source: APPLICATION
it: APPLICAZIONE

# HYT_projectcard_string_device
source: Device{INTERPOLATION}
it: Device

# HYT_projectcard_string_rule
source: Rule{INTERPOLATION}
it: Regola

# HYT_projects
source: Projects
it: Progetti

# HYT_add_new_project
source: Add new project
it: Aggiungi un progetto

# HYT_page_is_loading
source: Page is loading...
it: Pagina in caricamento...

# HYT_project_list
source: Project list
it: Lista progetti

# HYT_search
source: Search
it: Cerca

# HYT_select_sort_type
source: Select a sort type
it: Seleziona tipo ordinamento

# HYT_no_project_found
source: No project that matches the search found...
it: Nessun progetto trovato che soddisfi la ricerca

# HYT_no_project
source: There are no projects!
it: Non ci sono progetti

# HYT_add_project_button_hint
source: To add a project click the button below.
it: Per aggiungere un progetto clicca il bottone qui sotto

# HYT_create_first_project
source: Create your first project
it: Crea il tuo primo progetto

# HYT_error_occurred_long
source: An error has occurred, contact the administrator!
it: Si è verificato un errore. Contatta l'amministratore

# HYT_none
source: None
it: Nessuno

# HYT_oldest
source: Oldest
it: Dal più vecchio al più nuovo

# HYT_newest
source: Newest
it: Dal più unovo al più vecchio

# HYT_success
source: Success
it: Successo

# HYT_project_successfully_deleted
source: The project was successfully deleted.
it: Il progetto è stato eliminato correttamente

# HYT_error_deleting_project
source: An error occurred while deleting the project.
it: Errore nell'eliminazione del progetto

# HYT_loading
source: Loading
it: Caricamento
