Repository: HyperIoT-Labs/HyperIoT-UI
Catalog: src/locale/translations.*.xlf
Languages: it

# HYT_deleting_project
source: Deleting of project "{PH}" in loading. It may take a while.
it: Eliminazione del progetto in corso. Questa operazione potrebbe richiedere un po' di tempo.

# HYT_general_info
source: General Info
it: Info generali

# HYT_your_role_is
source: Your role is
it: Il tuo ruolo è

# HYT_your_current_plan_is
source: Your current plan is:
it: Il tuo piano attuale è

# HYT_this_plan_includes
source: This plan includes
it: Questo piano include

# HYT_devices
source: Devices
it: Dispositivi

# HYT_personal_info
source: Personal Info
it: Info personali

# HYT_update_personal_info
source: Update Personal Info
it: Aggiorna info personali

# HYT_change_password
source: Change password
it: Cambia password

# HYT_company_info
source: Company Info
it: Info azienda

# HYT_generic_error
source: Something went wrong
it: Qualcosa è andato storto

# HYT_user_updated
source: Personal information updated correctly
it: Informazioni personali aggiornate con successo

# HYT_password_changed
source: Password changed correctly
it: Password modificata con successo

# HYT_discard
source: Discard
it: Scarta

# HYT_edit_in_wizard
source: Edit in wizard
it: Modifica nel wizard

# HYT_edit
source: Edit
it: Modifica

# HYT_loading_project_tree
source: Loading project tree
it: Caricamento project tree

# HYT_error_project_tree
source: Error loading project tree
it: Errore caricamento project tree

# HYT_loading_tags
source: Loading Tags
it: Caricamento Tags

# HYT_sort_by
source: Sort by:
it: Ordina per:

# HYT_add_tag
source: Add Tag
it: Aggiungi tag

# HYT_no_tags_found
source: No tags found, create one!
it: Nessun tag trovato, creane uno!

# HYT_list_tags
source: List of Tags
it: Lista di Tag

# HYT_error_loading_tags_data
source: Error loading tags data
it: Errore nel caricamento dei dati dei tag

# HYT_project_categories
source: Project Categories
it: Categorie progetto

# HYT_add
source: Add
it: Aggiungi

# HYT_widget_add_quantity
source: Quantity
it: Quantità

# HYT_widget_info_type
source: Type
it: Tipo

# HYT_widget_info_intro
source: Select one or more widgets to add in the dashboard.. etc... etc...
it: Seleziona uno o più widget da aggiungere alla dashboard.. etc.. etc...

# HYT_add_widget
source: Add widget
it: Aggiungi widget

# HYT_widget_settings_select_packet
source: Select packet
it: Seleziona pacchetto

# HYT_button_add
source: Add
it: Aggiungi

# HYT_widget_settings_title
source: Widget Settings
it: Impostazioni Widget

# HYT_apply
source: Apply
it: Applica

# HYT_toolbar_move
source: Move
it: Sposta

# HYT_toolbar_settings
source: Settings
it: Impostazioni

# HYT_toolbar_refresh
source: Refresh
it: Aggiorna

# HYT_toolbar_close
source: Close
it: Chiudi

# HYT_common_not_configured
source: Click 'Settings' button to configure.
it: Premi il pulsante 'Impostazioni' per configurare il widget.

# HYT_no_widget_in_dashboard
source: You have no widgets in this dashboard.
it: Non ci sono widget in questa dashboard

# HYT_start_adding_widget
source: Start adding widgets.
it: Comincia ad aggiungere widget

# HYT_data_recording
source: Data recording
it: Registrazione dati

# HYT_widget_settings_apply
source: Apply
it: Applica

# HYT_widget_settings_cancel
source: Cancel
it: Annulla

# HYT_loading_request
source: Loading request
it: Caricamento richiesta

# HYT_submitting failed
source: Submitting failed
it: Attivazione fallita

# HYT_connecting
source: Connecting...
it: Connessione...

# HYT_connecting_failed
source: Connecting failed
it: Connessione fallita

# HYT_starting
source: Starting...
it: Avvio...

# HYT_starting_failed
source: Starting failed
it: Avvio fallito

# HYT_started
source: Started!
it: Avviato!

# HYT_try_again
source: Try again
it: Prova ancora

# HYT_request_failed
source: Request failed
it: Richiesta fallita

# HYT_loading_to_off
source: Loading to off...
it: Caricamento in corso...

# HYT_completed
source: Completed
it: Completato

# HYT_attention
source: Attention!
it: Attenzione!

# HYT_dashboard_end_registration
source: Proceeding with this action you will disable the registration of the data and they will not be stored until the rehabilitation of this property
it: Procedendo con questa azione disabiliterai la registrazione dei dati che non saranno salvati fino alla riabilitazione di questa proprietà

# HYT_dashboard_event_fired
source: The event has been fired
it: L'evento è stato emesso

# HYT_dashboard_alarm_cleared
source: Alarm cleared
it: Allarme rimosso

# HYT_reload
source: Reload
it: Ricarica

# HYT_add_a_widget
source: Add a widget
it: Aggiungi un widget

# HYT_no_dashboard_yet
source: You have not configured any dashboard yet.
it: Non hai ancora configurato nessuna dashboard

# HYT_welcome_to_hyperiot
source: Welcome to HyperIoT
it: Benvenuto su HyperIoT

# HYT_home_message_1
source: For now the page is empty but if you want you can view your projects by clicking the button below
it: Per adesso la pagina è vuota ma se vuoi puoi vedere i tuoi progetti cliccando il bottone qui sotto

# HYT_go_to_your_projects
source: Go to your Projects
it: Vai ai tuoi progetti

# HYT_area_map_select_device
source: Select device
it: Seleziona dispositivo

# HYT_area_map_select_area
source: Select area
it: Seleziona area

# HYT_area_list_noimage
source: (no image)
it: (immagine assente)

# HYT_area_list_bim
source: BIM Model Loaded
it: Modello BIM caricato

# HYT_area_list_nomedia
source: (No Media Uploaded)
it: (Nessun Media caricato)

# HYT_area_draggable_title
source: Move {INTERPOLATION}
it: Sposta {{itemData.device ? itemData.device.deviceName : itemData.name}}

# HYT_area_draggable_remove
source: Remove {INTERPOLATION}
it: Rimuovi {{itemData.device ? itemData.device.deviceName : itemData.name}}

# HYT_area_draggable_open
source: Open {INTERPOLATION}
it: Apri {{itemData.device ? itemData.device.deviceName : itemData.name}}

# HYT_draggableitem_move
source: Move
it: Muovi

# HYT_draggableitem_remove
source: Remove
it: Rimuovi

# HYT_area_path_main
source: Main
it: Principale

# HYT_hint_area_name
source: Enter area name
it: Inserire nome area

# HYT_hint_area_description
source: Enter area description
it: Inserire descrizione area

# HYT_area_add
source: Add area
it: Aggiungi area

# HYT_area_section_inner
source: Sub-areas ({INTERPOLATION})
it: Sottoaree ({{ areaList.length }})

# HYT_area_inner_add
source: Add sub-area
it: Aggiungi sotto-area

# HYT_area_section_static_image
source: Image
it: Immagine

# HYT_area_section_map
source: Map
it: Mappa

# HYT_area_set_image
source: Set image
it: Imposta immagine

# HYT_area_set_bim_model
source: Set model
it: Imposta modello

# HYT_area_map_device_add
source: Add device
it: Aggiungi dispositivo

# HYT_area_map_area_add
source: Add sub-area
it: Aggiungi sotto-area

# HYT_project_areas
source: Project Areas
it: Aree progetti

# HYT_project_areas_static_image
source: STATIC IMAGE
it: IMMAGINE STATICA

# HYT_project_areas_dynamic_map
source: DYNAMIC MAP
it: MAPPA DINAMICA

# HYT_project_areas_bim_xkt_format
source: BIM IN XKT FORMAT
it: BIM IN FORMATO XKT

# HYT_project_areas_bim_ifc_format
source: BIM IN IFC FORMAT
it: BIM IN FORMATO IFC

# HYT_area_treeview
source: Area Treeview
it: alberatura Area

# HYT_return_area_project
source: Return to project areas
it: Ritorna alle aree del progetto

# HYT_loading_area_media
source: Loading Area Media
it: Caricamento Media

# HYT_loading_media_error
source: Loading Media Error
it: Errore Caricamento Media

# HYT_area_tree_loading
source: Loading Treeview
it: Caricamento Treeview

# HYT_area_tree_error
source: Error Loading
it: Errore nel Caricamento

# HYT_file_size_exceed
source: File size exceed limit of {PH} bytes
it: Il file supera il limite di {PH} bytes

# HYT_file_type_must_be
source: File type must be {PH}
it: Il file deve essere di tipo {PH}

# HYT_areas
source: Areas
it: Aree

# HYT_areas_no_areas_defined
source: No areas defined.
it: Nessuna Area è stata definita

# HYT_areas_select_area_from_list
source: Select an area from the list below
it: Seleziona un'area dalla lista sottostante

# HYT_areas_show_treeview
source: Show
it: Mostra

# HYT_areas_hide_treeview
source: Hide
it: Nascondi

# HYT_areaa_go_to_create_area
source: Create the first area for this project
it: Crea la prima area per questo progetto

# HYT_area_confirm_title_change_type
source: Changing the area type
it: Cambio tipologia di area

# HYT_area_confirm_body_change_type
source: Changing this setting will erase all previous settings
it: Modificando questa impostazione tutti i precedenti settaggi verranno cancellati

# HYT_area_confirm_btn_confirm
source: Confirm
it: Conferma

# HYT_area_confirm_btn_reject
source: Reject
it: Rifiuta

# HYT_area_loading_bim_model
source: BIM Model Loading...
it: Caricamento modello BIM...

# HYT_area_empty_bim_model
source: No Model
it: Nessun modello presente

# HYT_dashboard_list
source: Dashboard list
it: Lista dashboard

# HYT_no_dashboard_for_user
source: No dashboards found for this user
it: Nessuna dashboard trovata

# HYT_to_install_the_app_from_safari
source: To install the app from Safari, tap the share button
it: Per installare l'app da Safari, fai tap sul bottone della condivisione

# HYT_then_swipe_up_to_find_and_tap_add_to_home_screen
source: Then swipe up to find and tap "Add to home screen"
it: Dopo scorri fino a trovare "Aggiungi alla Home" e fai tap

# HYT_to_install_the_app_from_firefox
source: To install the app from Firefox, tap the settings button
it: Per installare l'appda Firefox, fai tap sul bottone delle impostazioni

# HYT_then_tap_install
source: Then tap "Install"
it: Dopo fai tap sulla voce "Installa"

# HYT_data_recording_is_disabled
source: Data recording is disabled
it: La registrazione dei dati è disabilitata

# HYT_data_recording_is_disabled_text
source: The online dashboard cannot be used in this state. You can activate data recording by pressing the "RUN" button or you can use the dasboard offline taking the "OFFLINE" button.
it: La dashboard online non può essere utilizzata in questo stato. È possibile attivare la registrazione dei dati premendo il pulsante "RUN" oppure è possibile utilizzare la dasboard offline utilizzando il pulsante "OFFLINE".

# HYT_waiting_for_data
source: Waiting for data
it: In attesa dei dati

# HYT_waiting_for_data_text
source: The data recording is activated but we waiting for the data. This operation might take a while (from 20 seconds, up to 1 minute), if the loading state persist click "Reload" or contact the administrator.
it: La registrazione dei dati è attiva ma siamo in attesa dei dati. Questa operazione potrebbe richiedere del tempo (da 20 secondi fino a 1 minuto), se lo stato di caricamento persiste, fare clic su "RELOAD" o contattare l'amministratore.

# HYT_deleting_algorithm
source: Deleting of algorithm "{PH}" in loading. It may take a while.
it: Eliminazione dell'algoritmo in corso. Questa operazione potrebbe richiedere un po' di tempo.

# HYT_algorithm_successfully_deleted
source: The algorithm was successfully deleted.
it: L'algoritmo è stato eliminato correttamente

# HYT_error_deleting_algorithm
source: An error occurred while deleting the algorithm.
it: Errore nell'eliminazione dell'algoritmo

# HYT_algorithms
source: Algorithms
it: Algoritmi

# HYT_add_new_algorithm
source: Add new algorithm
it: Aggiungi un algoritmo

# HYT_algorithm_list
source: Algorithm list
it: Lista algoritmi

# HYT_no_algorithm_found
source: No algorithm that matches the search found...
it: Nessun algoritmo trovato che soddisfi la ricerca

# HYT_no_algorithm
source: There are no algorithms!
it: Non ci sono algoritmi

# HYT_add_algorithm_button_hint
source: To add an algorithm click the button below.
it: Per aggiungere un algoritmo clicca il bottone qui sotto

# HYT_create_first_algorithm
source: Create your first algorithm
it: Crea il tuo primo algoritmo

# HYT_algorithms_wizard
source: Algorithms Wizard
it: Wizard Algoritmo

# HYT_algorithm_displaylistname
source: Algorithms
it: Algoritmi

# HYT_algorithm_form_title
source: Algorithms
it: Algoritmi

# HYT_algorithms_short_definition
source: Algorithms short definition
it: Algoritmi definizione breve...

# HYT_algorithms_definition
source: Algorithms definition
it: Algoritmi definizione ...

# HYT_algorithms_long_definition
source: Algorithms long definition
it: Algoritmi definizione lunga...

# HYT_unavailable_algorithm_name
source: Unavailable algorithm name
it: Nome algoritmo non disponibile

# HYT_hint_algorithm_name
source: Enter the algorithm name.
it: Inserire nome algoritmo.

# HYT_algorithm_packets
source: Packets
it: Pacchetti

# HYT_hint_algorithm_packets
source: Set input
it: Selezionare l'input

# HYT_hint_algorithm_description
source: Enter the algorithm description.
it: Inserire descrizione algoritmo.

# HYT_algorithm_input_single_packet
source: One packet only
it: Singolo pacchetto

# HYT_algorithm_input_more_packets
source: More packets
it: Più pacchetti

# HYT_algorithm_output_field
source: Output field
it: Campo output

# HYT_unavailable_output_field_name
source: Unavailable output field name
it: Nome campo output non disponibile

# HYT_unavailable_input_field_name
source: Unavailable input field name
it: Nome campo input non disponibile

# HYT_algorithm_input_field
source: Input field
it: Campo input

# HYT_bind_input_fields
source: Bind input fields
it: Associa campi input

# HYT_select_algorithm_packet_before
source: Select algorithm and packet before
it: Seleziona prima l'algoritmo e il pacchetto

# HYT_input_definition_modal_title
source: Bind packet fields to algorithm input
it: Associa i campi del pacchetto agli input dell'algoritmo

# HYT_available_packet_fields
source: Available packet fields
it: Campi del pacchetto disponibili

# HYT_error_loading_statistic_input
source: An error occurred while loading statistic input. This may have happened for one or more of the following reasons:
it: Errore nel caricamento dell'input della statistica. Questo può essere legato ad una o più delle seguenti ragioni:

# HYT_statistic_input_packet_deleted
source: A packet has been deleted
it: Un pacchetto è stato eliminato

# HYT_statistic_input_field_deleted
source: A field has been deleted
it: Un campo è stato eliminato

# HYT_error_loading_statistic_input_hint
source: Please, redefine a new statistic and delete the old one.
it: Per favore, definisci una nuova statistica ed elimina la precedente

# HYT_no_available_fields
source: There are not available fields anymore
it: Non ci sono ulteriori campi disponibili

# HYT_no_field_found
source: No field found
it: Nessun campo trovato

# HYT_input_binding_done
source: Input binding done
it: Associazione input effettuata

# HYT_algorithm_main_classname
source: Main classname
it: Nome classe contenente il metodo main

# HYT_hint_algorithm_main_classname
source: Enter the main classname
it: Inserisci il nome della classe contenente il metodo main

# HYT_widget_settings_select_algorithm
source: Select algorithm
it: Seleziona algoritmo

# HYT_hint_hproject_algorithm_name
source: Enter statistic name
it: Inserisci il nome della statistica

# HYT_unavailable_hprojectalgorithm_name
source: Unavailable statistic name
it: Nome statistica non disponibile

# HYT_tag_select_color
source: Select color
it: Seleziona colore

# HYT_algorithm_file_exists
source: exists
it: è presente

# HYT_algorithm_file_not_exists
source: does not exist
it: non è presente

# HYT_algorithm_choose_file
source: Choose File
it: Scegli File

# HYT_reload_topology_alert
source: Changes have been made to data recording configuration. To make them effective you need to restart data recording, do you want to start it now? Anyway, the data you are sending won’t be lost.
it: La configurazione del data recording è stata modificata. Per renderla effettiva è necessario riavviare il data recording, vuoi riavviare adesso? In ogni caso non prederai i dati che stai inviando.

# HYT_algorithm_required_input_fields
source: Algorithm required input fields
it: Campi richiesti per l'algoritmo

# HYT_summary_list_no_packets
source: No Packets
it: Nessun Pacchetto

# HYT_unavailable_alarm_name
source: Unavailable alarm name
it: Nome allarme non disponibile

# HYT_add_alarm
source: Add alarm
it: Aggiungi allarme

# HYT_hint_alarm_name
source: Enter the alarm name
it: Inserire il nome dell'allarme.

# HYT_alarm_event_actions
source: Actions
it: Azioni

# HYT_alarmEvent_message
source: At least one new event must be added to save the new alarm!
it: Almeno un nuovo evento deve essere aggiunto per salvare un nuovo allarme!

# HYT_aliases_description
source: Enter an alternate name to be displayed in the widget. In case the alias is empty the field name will be displayed
it: Inserisci un nome alternativo da visualizzare come intestazione delle colonne, in caso l'alias sia vuoto verrà visualizzato il nome del field

# HYT_unavailble_widget_description
source: This widget is unavailable
it: Questo widget non è disponibile

# HYT_widget_settings_text_color
source: Text color:
it: Colore del testo:

# HYT_system_information
source: System information
it: Informazioni di sistema

# HYT_ui_version
source: UI version
it: Version UI

# HYT_services_version
source: Services version
it: Versione Servizi

# HYT_widget_settings_bg_color
source: Background color:
it: Colore dello sfondo:

# HYT_widget_settings_bg_color_bright
source: Bright
it: Chiaro

# HYT_widget_settings_bg_color_dark
source: Dark
it: Scuro

# HYT_pattern_error_default_message
source: Invalid input
it: Input non valido

# HYT_alphanumeric_underscore_only
source: Only alphanumeric and underscore (_) characters allowed
it: Solo caratteri alfanumerici o trattino basso (_) ammessi

# HYT_hpacketfield_object_multiplicity_warn
source: Fields of type Object cannot be of multiplicity array or matrix
it: I campi di tipo Object non possono avere molteplicità array o matrice

# HYT_auto_update_config_warn
source: Attention! An automatic update has been applied to the widget configuration to make it compatible with the latest updates. It is necessary to save the configuration to make the change effective.
it: Attenzione! È stato applicato un aggiornamento automatico alla configurazione del widget per renderla compatibile con gli ultimi aggiornamenti. È necessario salvare la configurazione per rendere effettiva la modifica.

# HYT_auto_update_config_error
source: Error! Unable to update the widget configuration automatically. The widget may not work correctly after the latest updates. It is recommended to delete the widget and set up a new one.
it: Errore! Impossibile aggiornare automaticamente la configurazione del widget. Il widget potrebbe non funzionare correttamente dopo gli ultimi aggiornamenti. È raccomandato eliminare il widget e riconfigurarne uno nuovo.

# HYT_fields_customization
source: Fields Customization
it: Personalizzazione campi

# HYT_alias_title
source: Field Alias
it: Alias del campo

# HYT_unit_conversion_title
source: Unit Conversion
it: Conversione

# HYT_widget_delete_confirm
source: Attention, the widget and its configuration will be permanently deleted. Proceed?
it: Attenzione, il widget e la sua configurazione saranno eliminati definitivamente. Continuare?

# HYT_widget_delete_confirm_dismiss
source: Do not ask for confirmation for this dashboard anymore
it: Non richiedere più conferma per questa dashboard

# HYT_connection_failed
source: Conection to Hyperiot services failed.
it: Connessione ai servizi Hyperiot fallita.

# HYT_reconnect
source: Reconnect
it: Riconnetti

# HYT_not_authorized_password
source: Not authorized to connect. Please, check the device password in the widget configuration.
it: Non autorizzato. Controlla che la password inserita nella configurazione del widget sia corretta.

# HYT_connection_closed_host
source: Connection closed by host.
it: Connessione chiusa dall'host.

# HYT_source_password
source: Source password
it: Password Fonte

# HYT_period_ms
source: Period (ms)
it: Periodo (ms)

# HYT_data_generation_rule
source: Data Generation Rule
it: Regola di generazione dati

# HYT_generation_rule
source: Generation Rule
it: Regola di generazione

# HYT_generation_type
source: Generation Type
it: Tipo di generazione

# HYT_fixed_value_description
source: Emit a fixed value
it: Emette un valore fisso

# HYT_range_value_description
source: Emit a random value between two numbers
it: Emette un valore casuale tra due numeri

# HYT_dataset_value_description
source: <ng-containEmit values of a dataset<mat-form-field>abel i18n="@@HYT{{ typeOption.label }}Dataset example: at-select> </mat-form-fie[ 0, 2, 4, 8 ]gs"> <ng-container *nged'"> <div class="r{{ typeOption.label }}Dataset example: at-select> </mat-form-fie[ [ 0, 4 ], [ 3, -1] ]gs"> <ng-container *nged'"> <div class="rT_fixed_value_des
it: <ng-containEmette valori di un set di dati<mat-form-field>abel i18n="@@HYT{{ typeOption.label }}Esempio Dataset: at-select> </mat-form-fie[ 0, 2, 4, 8 ]gs"> <ng-container *nged'"> <div class="r{{ typeOption.label }}Esempio Dataset: at-select> </mat-form-fie[ [ 0, 4 ], [ 3, -1] ]gs"> <ng-container *nged'"> <div class="rT_fixed_value_des

# HYT_data_simultaor_type_not_supported
source: Type iner *ngIf="rul "> <ma currently not supported
it: Tipo iner *ngIf="rul "> <ma attualmente non supportato

# HYT_outliers_description
source: Outlier value is a specific value emitted when the user press the 'oultier' button
it: Il valore di outlier è un valore specifico che viene emesso quando l'utente preme il bottone 'outlier'

# HYT_packet_sent
source: Packet sent: dget><hype
it: Pacchetti inviati: dget><hype

# HYT_source
source: Source
it: Fonte di dati

# HYT_sources
source: Sources
it: Fonti di dati

# HYT_sharedWith
source: Shared with
it: Condivisa con

# HYT_sharedBy
source: Shared by
it: Condivisa da

# HYT_sortNew
source: Sort by newest
it: Ordina per i piú recente

# HYT_sortOld
source: Sort by oldest
it: Ordina per meno recente

# HYT_sortAlphaAsc
source: Sort alphabetically A-Z
it: Ordine alfabetico A-Z

# HYT_sortAlphaDesc
source: Sort alphabetically Z-A
it: Ordine alfabetico Z-A

# HYT_all
source: All
it: Tutti

# HYT_filterPersonal
source: Show personal projects
it: Mostra progetti personali

# HYT_filterOwner
source: Show owned projects
it: Mostra progetti convidisi con altri utenti

# HYT_filterPartecipant
source: Show projects shared from other user
it: Mostra progetti condivisi da altri utenti

# HYT_projectType
source: Project Type
it: Tipo di progetto

# HYT_sortBy
source: Sort by
it: Ordina per

# HYT_viewProject
source: view project
it: apri progetto

# HYT_projectsCount
source: Showing {{hProjectsFiltered.length}} projects of {{hProjects.length}}
it: Mostrati {{hProjectsFiltered.length}} progetti su {{hProjects.length}}

# HYT_projects_shared_title_listColl
source: Collaborator list
it: Lista collaboratori

# HYT_projects_shared_title_deleteColl
source: Delete collaborator
it: Elimina collaboratore

# HYT_projects_shared_title_addColl
source: Add collaborator
it: Aggiungi collaboratore

# HYT_projects_shared_title_success
source: Operation confirmed
it: Operazione confermata

# HYT_projects_shared_title_loading
source: Loading
it: Caricamento

# HYT_projects_shared_title_error
source: Error
it: Errore

# HYT_projects_shared_title_userAlreadyExist
source: User already exist
it: Utente giá esistente

# HYT_projects_userAlreadyExist
source: The user is already linked to the project, what do you want to do?
it: L'utente é giá collegato a questo progetto, come vuoi continuare

# HYT_projects_addAgain
source: The user is already linked to the project, what do you want to do?
it: L'utente é giá collegato a questo progetto, come vuoi continuare

# HYT_projects_backToProjectList
source: Back to the list
it: Torna alla lista
