Repository: HyperIoT-Labs/HyperIoT-UI
Catalog: src/locale/translations.*.xlf
Languages: it

# HYT_errorOverlay
source: Close the overlay by clicking X and try again. If the error persists, contact us
it: Chiudi il pannello cliccando la X e riprova. Se l'errore sussite, contattaci

# HYT_confirm_remove_coll
source: ARE YOU SURE TO REMOVE <x id="INTERPOLATION" equiv-text='{{printCollaboratorName(collaboratorFocused)}}'/> AS COLLABORATOR OF THE PROJECT?
it: SEI SICURO DI VOLER RIMUOVERE <x id="INTERPOLATION" equiv-text='{{printCollaboratorName(collaboratorFocused)}}'/> COME COLLABORATORE DEL PROGETTO?

# HYT_new_collaborator
source: New collaborator
it: Nuovo collaboratore

# HYT_projects_share
source: share
it: Condividi

# HYT_success_share
source: Operation successful! Click the button below for go back to collaborator list
it: Operazione riuscita! Fare clic sul pulsante qui sotto per tornare alla lista dei collaboratori

# HYT_generic_error_share
source: Chiudere la schermata facendo clic su X e riprovare. Se l'errore persiste, contattaci
it: Errore

# HYT_target
source: Target
it: Obiettivo

# HYT_produced
source: Produced
it: Prodotti

# HYT_current_shift
source: Current Shift
it: Turno Corrente

# HYT_enter_target
source: Manually enter a target number
it: Inserire un obiettivo di produzione

# HYT_remaining
source: Left to Produce
it: Residui

# HYT_optional
source: (optional)
it: (facoltativo)

# HYT_noRangeSelected
source: Select a range to display the graph...
it: Seleziona un range per mostrare il grafico...

# HYT_plotly_fit_to_timeline
source: Fit to timeline
it: Adatta alla selezione

# HYT_authorization_error
source: Athorization error
it: Errore di Autorizzazione

# HYT_authentication_error
source: Authentication error
it: Errore di Autenticazione

# HYT_you_do_not_have_sufficient_permissions_to_perform_this_operation
source: You do not have sufficient permissions to perform this operation
it: Non hai i permessi sufficienti per effettuare questa operazione

# HYT_alarm_status_active
source: Active
it: Attivo

# HYT_alarm_status_inactive
source: Inactive
it: Inattivo

# HYT_alarm_no_filter
source: NO FILTER SELECTED.
it: NESSUN FILTRO SELEZIONATO.

# HYT_alarm_click_to_filter
source: CLICK FILTER BUTTON TO FILTER ALARMS
it: CLICCA IL BOTTONE PER FILTRARE GLI ALLARMI

# HYT_alarm_filter_from
source: FILTERING ALARMS FOR:
it: FILTRANDO ALLARMI PER:

# HYT_alarm_hidden_filter
source: There are alarms, but they're being hidden by the filter!
it: Ci sono allarmi ma vengono nascosti dai filtri selezionati!

# HYT_alarm_no_fired
source: No alarms fired
it: Nessun allarme attivo

# HYT_alarm_low_sev
source: Low
it: Bassa

# HYT_alarm_medium_sev
source: Medium
it: Media

# HYT_alarm_high_sev
source: High
it: Alta

# HYT_alarm_critical_sev
source: Critical
it: Critico

# HYT_alarm_showing_text
source: Showing
it: Mostrando

# HYT_alarm_showing_text_of
source: of
it: su

# HYT_conditions
source: Conditions
it: Condizioni

# HYT_field_box_info
source: Selection of the package and device is required!
it: La selezione del pacchetto e del dispositivo è necessaria!

# HYT_fields_fit_to_timeline
source: Fit to timeline
it: Adatta alla timeline

# HYT_noData
source: No data to display
it: Nessun dato da visualizzare

# HYT_notification_active
source: Notification ACTIVE
it: Notifiche ATTIVE

# HYT_notification_inactive
source: Notification INACTIVE
it: Notifiche INATTIVE

# HYT_notification_list
source: Notification list
it: Lista notifiche

# HYT_notifications
source: NOTIFICATIONS
it: NOTIFICHE

# HYT_no_notifications
source: No notifications
it: Nessuna notifica

# HYT_branding
source: Branding
it: Brandizzazione

# HYT_logo_is_required_for_the_first_theme_customization
source: * Logo is required for the first theme customization
it: * Il logo è obbligatorio per la prima personalizzazione del tema

# HYT_upload_your_logo
source: Upload your logo
it: Carica il tuo logo

# HYT_upload
source: Upload
it: Carica

# HYT_preview
source: Preview
it: Anteprima

# HYT_color_schema
source: Color Schema
it: Schema Colore

# HYT_primary_color
source: Primary Color
it: Colore primario

# HYT_secondary_color
source: Secondary Color
it: Colore Secondario

# HYT_restore_default
source: Restore default
it: Ripristina default

# HYT_saving_branding_theme_error
source: Saving branding theme error
it: Errore nel salvataggio del tema

# HYT_restoring_default_theme_error
source: Restoring default theme error
it: Errore nella ripristinazione del tema

# HYT_you_have_access_to
source: You have access to
it: Hai accesso a

# HYT_theme_customization
source: Theme customization
it: Personalizzazione del tema

# HYT_reset
source: Reset
it: Ripristina

# HYT_go_to_device_dashboard
source: Go to Device Dashboard
it: Vai alla dashboard del device

# HYT_go_to_alarm_manager
source: Go to Alarm Manager
it: Vai al manager dell'allarme

# HYT_back_to_projects
source: Back to projects
it: Torna ai progetti

# HYT_back_to_area
source: Back to area
it: Torna all'area
